app/controllers/api/historics_controller.rb

  def find_viewer
    @viewers = Viewer.where(profile: @profile).limit(3)
    @viewer_watching = Viewer.where(profile: @profile, status: 'watching')
---
SELECT  "viewers".* FROM "viewers" WHERE "viewers"."profile_id" = 1 ORDER BY "viewers"."id" DESC LIMIT $1  [["LIMIT", 3]]
SELECT "viewers".* FROM "viewers" WHERE "viewers"."profile_id" = 1 AND "viewers"."status" = $1  [["status", "watching"]]