app/controllers/api/profiles_controller.rb

INSERT INTO "profiles" ("user_id", "birthday", "about", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", "1"], ["birthday", "17/06/1988"], ["about", "Addicted to korean dramas"], ["created_at", "2018-06-13 23:57:54.190037"], ["updated_at", "2018-06-13 23:57:54.190037"]]
---
  def create
    @profile = Profile.create!(profile_params)

SELECT "viewers".* FROM "viewers" WHERE "viewers"."user_id" = $1 AND "viewers"."status" = $2  [["user_id", "1"], ["status", "watch_later"]]
---
  def index
    @later = Viewer.where(user_id: @user_id, status: 'watch_later')

UPDATE "profiles" SET "birthday" = $1, "about" = $2, "updated_at" = $3 WHERE "profiles"."id" = $4  [["birthday", "20/10/2000"], ["about", "Addicted to chinese dramas"], ["updated_at", "2018-06-14 00:09:28.846440"], ["id", 3]]
---
  def update
    @profile.assign_attributes update_profile_params
    @profile.save!

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 AND "profiles"."id" = $2 LIMIT $3  [["user_id", "3"], ["id", 3], ["LIMIT", 1]]
---
  def find_profile
    @profile = Profile.find_by! user_id: @user_id