app/controllers/api/profiles_controller.rb

SELECT "viewers".* FROM "viewers" WHERE "viewers"."profile_id" = 1 AND "viewers"."status" = $1  [["status", "watch_later"]]
---
  def show
    @later = Viewer.where(profile: @profile, status: 'watch_later')