app/controllers/api/progresses_controller.rb

INSERT INTO "progresses" ("viewer_id", "episode_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["viewer_id", 1], ["episode_id", 13], ["created_at", "2018-06-14 02:08:15.789021"], ["updated_at", "2018-06-14 02:08:15.789021"]]
---
  def create
    @progress = Progress.create!(progress_params)

SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT  "viewers".* FROM "viewers" WHERE "viewers"."profile_id" = $1 AND "viewers"."serie_id" = 1 ORDER BY "viewers"."id" ASC LIMIT $2  [["profile_id", 1], ["LIMIT", 1]]
---
  def find_episode
    @episode = Episode.find_by! id: params[:episode_id]
    serie = @episode.season.serie
    @viewer = @profile.viewers.where(serie: serie).first