app/controllers/api/progresses_controller.rb

  def find_episode
    Episode.find_by! id: params[:episode_id]
    Viewer.find_by! id: params[:viewer_id]
---
SELECT  "viewers".* FROM "viewers" WHERE "viewers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]