app/controllers/api/series_controller.rb

SELECT "series".* FROM "series"
---
  def index
    @series = Serie.all

INSERT INTO "series" ("title", "about", "launch_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "seasons".* FROM "seasons" WHERE "seasons"."serie_id" = $1  [["serie_id", 1]]
INSERT INTO "seasons" ("serie_id", "season_number", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["serie_id", 2], ["season_number", 1], ["title", "Temporada 1"], ["created_at", "2018-06-14 01:22:51.516069"], ["updated_at", "2018-06-14 01:22:51.516069"]]
INSERT INTO "episodes" ("title", "episode_number", "season_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Episódio 1"], ["episode_number", 1], ["season_id", 1], ["created_at", "2018-06-14 01:23:41.153461"], ["updated_at", "2018-06-14 01:23:41.153461"]]
---
  def create
    Serie.transaction do
      @serie = Serie.create!(serie_params)
      (1..params[:serie][:number_of_seasons]).each do |number|
        season = Season.create!(season_number: number, title: "Temporada #{number}", serie_id: @serie.id)
        (1..params[:serie][:episodes_per_season]).each do |episode_number|
          Episode.create!(title: "Episódio #{episode_number}", episode_number: episode_number, season_id: season.id)

SELECT  "series".* FROM "series" WHERE "series"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_serie
    @serie = Serie.find_by! id: params[:id]