app/controllers/api/viewers_controller.rb

  def create
    @viewer = Viewer.create!(viewer_params)
---
INSERT INTO "viewers" ("serie_id", "user_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["serie_id", 2], ["user_id", "1"], ["status", "watch_later"], ["created_at", "2018-06-26 02:24:08.167868"], ["updated_at", "2018-06-26 02:24:08.167868"]]

  def find_serie
    Serie.find_by! id: params[:serie_id]
---
SELECT  "series".* FROM "series" WHERE "series"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]