app/views/api/series/index.json.jbuilder

  json.extract! serie, :id, :title, :launch_date, :about
  json.number_of_seasons serie.seasons.count
---
SELECT COUNT(*) FROM "seasons" WHERE "seasons"."serie_id" = $1  [["serie_id", 1]]