app/controllers/public/authenticates_controller.rb

  def find_profile
    @profile = Profile.where(email: profile_params[:email]).first
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 ORDER BY "profiles"."id" ASC LIMIT $2  [["email", "ryan.douglas11@example.com"], ["LIMIT", 1]]