app/controllers/public/registrations_controller.rb

INSERT INTO "profiles" ("uid", "encrypted_password", "name", "email", "birthday", "about", "avatar_link", "tokens", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @profile = ::User.create!(profile_params)